Tekla.Structures.Catalogs.ShapeItem.Insert
Inserts a shape to the shape catalog based on the shape geometry.
Returns:
Return true on success.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void InsertSimpleCube()
{
var vertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(300.0,   0.0,   0.0), // 1
new Vector(300.0, 300.0,   0.0), // 2
new Vector(  0.0, 300.0,   0.0), // 3
new Vector(  0.0,   0.0, 300.0), // 4
new Vector(300.0,   0.0, 300.0), // 5
new Vector(300.0, 300.0, 300.0), // 6
new Vector(  0.0, 300.0, 300.0), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var brep = new FacetedBrep(vertices, outloop, innerLoop);
var shapeItem = new ShapeItem
{
Name = "MyNiceCubeBrep",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert();
}
}

Tekla.Structures.Catalogs.ShapeItem.CleanAndModify(System.Boolean@)
Cleans and stores the brep into the shape catalog
Returns: True if cleaning and storing to catalog was successful

Tekla.Structures.Catalogs.ShapeItem.Rename(System.String)
Renames a shape in the shape catalog with the given shape name.
Returns: True on success. False if the new name is empty or
duplicated as the current name, or other exceptions.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void InsertSimpleCube()
{
var vertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(300.0,   0.0,   0.0), // 1
new Vector(300.0, 300.0,   0.0), // 2
new Vector(  0.0, 300.0,   0.0), // 3
new Vector(  0.0,   0.0, 300.0), // 4
new Vector(300.0,   0.0, 300.0), // 5
new Vector(300.0, 300.0, 300.0), // 6
new Vector(  0.0, 300.0, 300.0), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var brep = new FacetedBrep(vertices, outloop, innerLoop);
var shapeItem = new ShapeItem
{
Name = "MyNiceCubeBrep",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert
result = shapeItem.Rename("RenamedCubeBrep");
if (result)
{
result = shapeItem.Name.Equals("RenamedCubeBrep");
}
}
}

Tekla.Structures.Catalogs.ShapeItem.SetHandlePoints(System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Set the Shape item's Handle Points
HandlePoints:
public void SetHandlePointsTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
var handlePoints = new List<Point>;
{
new Point(100.0, 100.0, 100.0),
new Point(-100.0, -100.0, -100.0),
};
shapeItem.SetHandlePoints(handlePoints);
}
Returns: True if success or False

Tekla.Structures.Catalogs.ShapeItem.FromStruct(Tekla.Structures.CatalogInternal.dotcatShape_t)
Copies from a struct.
shapeStruct:

Tekla.Structures.Catalogs.ShapeItem.ToStruct
Copies this instance to a struct.